# #ДЗУрок4 ДЭДЛАЙН 16.11.2023 23 59
# ДЗ: 
# ОСНОВНОЕ: Добавить в проект уникальную реализацию суперспособности  нижеперечисленных героев:

# 1. Magic должен увеличивать атаку каждого героя после каждого раунда на n-ное количество
# 2. Thor, удар по боссу имеет шанс оглушить босса на 1 раунд, вследствие чего босс пропускает 1 раунд и не наносит урон героям
# 3. Witcher, не наносит урон боссу, но получает урон от босса. Имеет 1 шанс оживить первого погибшего героя, отдав ему свою жизнь, при этом погибает сам.
# ДОПОЛНИТЕЛЬНОЕ: Добавить в проект уникальную реализацию суперспособности  3-х героев на ваш выбор из списка ниже:

# 4. Golem, который имеет увеличенную жизнь но слабый удар. Может принимать на себя 1/5 часть урона исходящего от босса по другим игрокам
# 5. Avrora, которая может входить в режим невидимости на 2 раунда (т.е не получает урон от босса), в тоже время полученный урон в режиме невидимости возвращает боссу в последующих раундах. Она может исчезать только один раз за игру
# 6. Druid, который имеет способность рандомно призывать помощника ангела героям или же ворона боссу на 1 раунд за всю игру. "Ангел" увеличивает способность медика лечить героев на  n кол-во. А ворон прибавляет  агрессию (увеличивается урон на 50%), боссу если его жизнь менее 50%.
# 7. Hacker, который будет через раунд забирать у Босса N-ое количество здоровья и переводить его одному из героев
# 8. Tricky,  способность которого будет состоять в том, чтобы притвориться мертвым в определенном раунде(из случайного выбора), но в следующем раунде он снова вступает в бой. При этом он не получает урон и не бьет босса когда притворился мертвым
# 9. AntMan, в каждом раунде он может увеличиться или же уменьшится на N-ный размер, также увеличиваются/уменьшаются жизнь и урон, после раунда он возвращается в исходный размер
# 10 Deku (сила удара может меняться каждый раунд с шансом 50 на 50,  может усилится на 20%, 50%, 100%, но при усилении теряется хп (чем сильнее усиление, тем больше хп потеряет герой)
# 11. Герой Kamikadze  без урона но хорошое здоровье, его способность  жертвовать собой. Но он должен попасть точно в цель, иначе нанесет урон только на 50% из своего остатка жизни.
# 12. Герой Samurai кидает сюрикенами которые делятся на два вида: 1) Вирус наносит N-e кол-во урона. 2) Вакцина лечит на N-e кол-во единиц здоровье босса. сюрикены выбирает Рандом.
# 13 Герой Bomber, когда босс убивает героя он взрывается и наносит боссу дополнительный урон в 100 единиц.
# 14. Reaper(Жнец) - при уровне здоровья менее 30% увеличивается урон вдвое, а при 15% втрое
# 15. Spitfire - каждый раз когда босс убивает одного или нескольких героев то наш герой показывает  агрессию на 80 единиц урона
# 16. Герой King, не наносить урон, только получает, с 10% шансом он может призвать героя Saitama который убьет босса с 1 удара